package com.demo.constant;

import lombok.Getter;

/**
 * <h1>统一返回状态枚举</h1>
 *
 * <p>
 * createDate 2020/11/11 11:11:11
 * </p>
 *
 * @author ALI[ali-k@foxmail.com]
 * @since 1.0.0
 **/
@Getter
public enum ResultEnum {

    /* ==================== 成功0 ==================== */
    /**
     * 成功0
     */
    OK(0, "成功"),

    /* ==================== 通用错误100-999 ==================== */
    /* -------------------- 系统错误100 --------------------*/
    /**
     * 100 系统内部错误
     */
    SYSTEM_INNER_ERROR(100, "系统内部错误"),
    /* -------------------- 找不到错误101-109 --------------------*/
    /**
     * 101 页面找不到
     */
    PAGE_NOT_FOUND(101, "页面找不到"),
    /* -------------------- 不支持错误110-119 --------------------*/
    /**
     * 110 请求方法不支持
     */
    REQUEST_METHOD_NOT_SUPPORTED(110, "请求方法不支持"),
    /**
     * 111 媒体类型不支持
     */
    MEDIA_TYPE_NOT_SUPPORTED(111, "媒体类型不支持"),
    /* -------------------- 参数错误120-129 --------------------*/
    /**
     * 120 请求参数错误
     */
    PARAM_ERROR(120, "请求参数错误"),

    /* ==================== 自定义错误1000-9999 ==================== */

    /* ==================== 未知错误-1 ==================== */
    /**
     * -1 未知错误
     */
    ERROR(-1, "未知错误");

    /**
     * 状态码
     */
    private final int code;
    /**
     * 状态信息
     */
    private final String msg;

    ResultEnum(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

}